app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if Artist.find_by(id:params[:artist_id]).nil?
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]

  def show
    if params[:artist_id]
      @artist=Artist.find(params[:artist_id])
      if @artist.songs.find_by(id:params[:id]).nil?
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 12345]]