app/controllers/songs_controller.rb

  def index
    if Artist.exists?(id:params[:artist_id])
      @songs=Artist.find(params[:artist_id]).songs
    else
      @songs = Song.all
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "songs".* FROM "songs"